HomeWork-3/reports/1.2G/withoutIndex/wrk-C1.txt
Running 5m test @ http://localhost:5000
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   329.63ms  156.62ms 755.23ms   64.87%
    Req/Sec     3.71      2.92    20.00     86.87%
  Latency Distribution
     50%  365.18ms
     75%  466.26ms
     90%  495.54ms
     99%  543.94ms
  910 requests in 5.00m, 1.15MB read
Requests/sec:      3.03
Transfer/sec:      3.91KB