HomeWork-3/reports/1.2G/withoutIndex/wrk-C100.txt
Running 5m test @ http://localhost:5000
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.96s     6.18s   29.87s    66.33%
    Req/Sec     2.06      3.24    30.00     90.02%
  Latency Distribution
     50%   14.56s 
     75%   18.04s 
     90%   22.03s 
     99%   26.76s 
  2010 requests in 5.00m, 2.53MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:      6.70
Transfer/sec:      8.63KB