HomeWork-3/reports/1.2G/withoutIndex/wrk-C1000.txt
Running 5m test @ http://localhost:5000
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.90s     6.90s   29.93s    65.52%
    Req/Sec     9.53     42.90   656.00     96.67%
  Latency Distribution
     50%   19.61s 
     75%   24.08s 
     90%   27.77s 
     99%   29.80s 
  4356 requests in 5.00m, 1.67MB read
  Socket errors: connect 0, read 0, write 0, timeout 4211
Requests/sec:     14.52
Transfer/sec:      5.70KB