HomeWork-3/reports/1.2G/withoutIndex/wrk2-R1.txt
Running 5m test @ http://localhost:5000
  1 threads and 1 connections
  Thread calibration: mean lat.: 684.019ms, rate sampling interval: 3358ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   332.36ms  151.08ms 504.32ms   65.52%
    Req/Sec     0.36      0.48     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  366.08ms
 75.000%  469.50ms
 90.000%  488.70ms
 99.000%  499.71ms
 99.900%  504.58ms
 99.990%  504.58ms
 99.999%  504.58ms
100.000%  504.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      21.279     0.000000            1         1.00
      91.071     0.100000           29         1.11
     172.159     0.200000           58         1.25
     230.399     0.300000           87         1.43
     313.343     0.400000          116         1.67
     366.079     0.500000          145         2.00
     407.295     0.550000          160         2.22
     458.239     0.600000          174         2.50
     463.615     0.650000          189         2.86
     467.455     0.700000          204         3.33
     469.503     0.750000          218         4.00
     471.039     0.775000          225         4.44
     473.087     0.800000          233         5.00
     474.879     0.825000          240         5.71
     479.487     0.850000          247         6.67
     483.839     0.875000          254         8.00
     486.399     0.887500          258         8.89
     488.703     0.900000          261        10.00
     491.007     0.912500          266        11.43
     492.287     0.925000          269        13.33
     492.799     0.937500          273        16.00
     493.055     0.943750          274        17.78
     494.335     0.950000          277        20.00
     494.591     0.956250          278        22.86
     495.871     0.962500          280        26.67
     496.383     0.968750          281        32.00
     496.639     0.971875          283        35.56
     496.639     0.975000          283        40.00
     497.919     0.978125          285        45.71
     497.919     0.981250          285        53.33
     499.455     0.984375          286        64.00
     499.455     0.985938          286        71.11
     499.711     0.987500          287        80.00
     499.711     0.989062          287        91.43
     501.247     0.990625          288       106.67
     501.247     0.992188          288       128.00
     501.247     0.992969          288       142.22
     502.783     0.993750          289       160.00
     502.783     0.994531          289       182.86
     502.783     0.995313          289       213.33
     502.783     0.996094          289       256.00
     502.783     0.996484          289       284.44
     504.575     0.996875          290       320.00
     504.575     1.000000          290          inf
#[Mean    =      332.359, StdDeviation   =      151.081]
#[Max     =      504.320, Total count    =          290]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  365.82ms
 75.000%  467.97ms
 90.000%  488.19ms
 99.000%  498.94ms
 99.900%  503.55ms
 99.990%  503.55ms
 99.999%  503.55ms
100.000%  503.55ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      19.791     0.000000            1         1.00
      88.959     0.100000           29         1.11
     171.135     0.200000           58         1.25
     228.991     0.300000           87         1.43
     311.807     0.400000          116         1.67
     365.823     0.500000          145         2.00
     406.527     0.550000          160         2.22
     456.959     0.600000          174         2.50
     462.591     0.650000          191         2.86
     466.431     0.700000          203         3.33
     467.967     0.750000          218         4.00
     470.015     0.775000          225         4.44
     471.551     0.800000          232         5.00
     473.599     0.825000          240         5.71
     478.207     0.850000          247         6.67
     483.327     0.875000          254         8.00
     485.631     0.887500          258         8.89
     488.191     0.900000          261        10.00
     489.215     0.912500          265        11.43
     491.007     0.925000          269        13.33
     492.031     0.937500          273        16.00
     492.287     0.943750          275        17.78
     493.055     0.950000          276        20.00
     493.311     0.956250          278        22.86
     494.847     0.962500          280        26.67
     495.103     0.968750          282        32.00
     495.103     0.971875          282        35.56
     495.359     0.975000          283        40.00
     496.127     0.978125          284        45.71
     496.383     0.981250          285        53.33
     498.943     0.984375          287        64.00
     498.943     0.985938          287        71.11
     498.943     0.987500          287        80.00
     498.943     0.989062          287        91.43
     500.223     0.990625          288       106.67
     500.223     0.992188          288       128.00
     500.223     0.992969          288       142.22
     501.247     0.993750          289       160.00
     501.247     0.994531          289       182.86
     501.247     0.995313          289       213.33
     501.247     0.996094          289       256.00
     501.247     0.996484          289       284.44
     503.551     0.996875          290       320.00
     503.551     1.000000          290          inf
#[Mean    =      331.146, StdDeviation   =      151.083]
#[Max     =      503.296, Total count    =          290]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  300 requests in 5.00m, 386.35KB read
Requests/sec:      1.00
Transfer/sec:      1.29KB